app/views/posts/_comments.html.erb

SELECT "comments".* FROM "comments"  WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
<ul>
<% commentable.comments.each do |comment| %>