app/controllers/comments_controller.rb

INSERT INTO "comments" ("message", "post_id", "title", "user_id") VALUES (?, ?, ?, ?)  [["message", "sdgdsg"], ["post_id", 11], ["title", "dfgfsg"], ["user_id", 2]]
---
	def create
		puts params
		comment = post.comments.new(comment_params)
		comment.user = current_user
		if comment.save