app/controllers/posts_controller.rb

  def create
    puts params
    current_user.posts.create(post_params)
---
INSERT INTO "posts" ("body", "title", "user_id") VALUES (?, ?, ?)  [["body", "Geniy"], ["title", "Rostik"], ["user_id", 2]]

  def update
    @post.assign_attributes(post_params)
    if @post.save
---
UPDATE "posts" SET "body" = ? WHERE "posts"."id" = 12  [["body", "W1"]]